## 15-2 데이터 관리 프로그램 만들기 (1) 파일 시스템 활용

### 1단계 문제 설명
___
파일(employeefile.txt)을 읽어들여 월급을 계산하고, 월급이 가장 높은 사원을 찾는 프로그램

### 2단계 summarize() 함수 그리고 슈도코드

In [ ]:
import pandas as pd
import numpy as np

def summarize():
    # 파일 이름을 입력 받는다.
    pd.read_csv('/data_handling/data/파일명')
    read.file
    # 파일을 읽기모드로 열어 한 줄씩 파일을 읽는다.
    read
    #파일의 각 행에

### 3단계. Employee Class 설계
___
인스턴스 변수로, name, division, jobgrade, years, basic 을 갖는 Employee 클래스를 코딩

In [3]:
# class Employee:
#     def __init__(self, name, division, jobgrade, years, basic):
#         self.name = name
#         self.division =division
#         self.jobgrade = int(jobgrade)
#         self.years = int(years)
#         self.basic = float(basic)
        
# print('슝=3')

슝=3

In [5]:
employee1 = Employee('Ahn TaeHee', 'AI Team', '3', '3', '300')

### 4단계. make_employee() 함수 선언
___

In [6]:
def make_employee(inputdata):
    name, division, jobgrade, year, basic = inputdata.split(',')
    return Employee(name, division, jobgrade, year, basic)

In [8]:
import os
file_path = os.getenv("HOME") +'/aiffel/data_handling/data/employeefile.txt'
print(file_path)
inputfile = open(file_path, 'r')

for i in inputfile:
    e = make_employee(i)

/home/jaejin/aiffel/data_handling/data/employeefile.txt

### 5단계. Employee Class 이어서...
___

In [13]:
class Employee:
    def get_name(self):
        return self.name
    
    def get_division(self):
        return self.division
    
    def get_jobgrade(self):
        return self.jobgrade
    
    def get_years(self):
        return self.years
    
    def get_basic(self):
        return self.basic
    
    def get_salary(self):
        self.salary = self.basic+(self.years*self.basic*0.1)
        return self.salary 
    
print('슝=3')

슝=3

### 6단계 전체 코드
___
파일을 열고 각 사원의 월급을 비교해서 가장 높은 월급을 가진 사원의 정보를 출력

In [14]:
import os

class Employee:
    def __init__ (self, name, division, jobgrade, years, basic):
        self.name = name
        self.division = division
        self.jobgrade = int(jobgrade)
        self.years = int(years)
        self.basic = float(basic)
        self.salary = 0
        

    def get_name(self):
        return self.name

    def get_division(self):
        return self.division
    
    def get_jobgrade(self):
        return self.jobgrade
    
    def get_years(self):
        return self.years
    
    def get_basic(self):
        return self.basic

    def get_salary(self):
        self.salary = self.basic + (self.basic * self.years * 0.1)
        return self.salary

    
def make_employee(inputdata):
    name, division, jobgrade, year, basic = inputdata.split(',')
    return Employee(name, division, jobgrade, year, basic)

def summarize():
    file_path = os.getenv("HOME") +  '/aiffel/data_handling/data/employeefile.txt'
    inputfile = open(file_path, 'r')
    highest = make_employee(inputfile.readline())
    for l in inputfile:
        e = make_employee(l)
        if e.get_salary() > highest.get_salary():
            highest = e
    inputfile.close()
    
    print("The name of the highest salary employee is: ", highest.get_name())
    print("Years of service: ", highest.get_years())
    print("Division: ", highest.get_division())
    print("Salay: ", highest.get_salary())

print('슝=3')

슝=3

In [16]:
summarize()

The name of the highest salary employee is:  Kim YoungJae
Years of service:  7
Division:   Sales
Salay:  1020.0

## 15-3 데이터 관리 프로그램 만들기 (2) Pandas와 csv 파일

__데이터 합치기 : merge, join, concat__ 
___

In [1]:
import pandas as pd

df1 = pd.DataFrame({'Student':['KimTaemin','HaJaehwa','JungSayoung','Sonjim','Leesoomin','KangJun'],
                   'Korean':[90,85,88,35,30,44],
                   'English':[80,90,40,44,55,90]})
df2 = pd.DataFrame({'Student':['KimTaemin','HaJaehwa','JungSayoung','Sonjimin','Leesoomin','KangJun'],
                   'Math':[100,55,38,43,68,82]})

print(df1)
print('--')
print(df2)

       Student  Korean  English
0    KimTaemin      90       80
1     HaJaehwa      85       90
2  JungSayoung      88       40
3       Sonjim      35       44
4    Leesoomin      30       55
5      KangJun      44       90
--
       Student  Math
0    KimTaemin   100
1     HaJaehwa    55
2  JungSayoung    38
3     Sonjimin    43
4    Leesoomin    68
5      KangJun    82

In [2]:
pd.merge(df1, df2)

       Student  Korean  English  Math
0    KimTaemin      90       80   100
1     HaJaehwa      85       90    55
2  JungSayoung      88       40    38
3    Leesoomin      30       55    68
4      KangJun      44       90    82

In [3]:
pd.merge(df1,df2, on='Student')

       Student  Korean  English  Math
0    KimTaemin      90       80   100
1     HaJaehwa      85       90    55
2  JungSayoung      88       40    38
3    Leesoomin      30       55    68
4      KangJun      44       90    82

In [4]:
df1 = pd.DataFrame({'Student': ['KimTaemin','HaJaehwa','JungSayoung','Sonjimin','Leesoomin','KangJun'],
                    'Korean': [90, 85, 88, 35, 40, 44],
                    'English': [80, 90, 40, 44, 55, 90]})
df2 = pd.DataFrame({'Student': ['Jiyoungmin','KimTaemin'],
                    'Math':[44,33]})

In [5]:
pd.merge(df1,df2)

     Student  Korean  English  Math
0  KimTaemin      90       80    33

In [7]:
pd.merge(df1,df2,on='Student')

     Student  Korean  English  Math
0  KimTaemin      90       80    33

In [8]:
pd.merge(df1,df2, how='outer')

       Student  Korean  English  Math
0    KimTaemin    90.0     80.0  33.0
1     HaJaehwa    85.0     90.0   NaN
2  JungSayoung    88.0     40.0   NaN
3     Sonjimin    35.0     44.0   NaN
4    Leesoomin    40.0     55.0   NaN
5      KangJun    44.0     90.0   NaN
6   Jiyoungmin     NaN      NaN  44.0

In [10]:
df1.join(df2, how='outer', lsuffix='_caller', rsuffix='_other')    #'_caller'인 df1 컬럼이 왼쪽에 가도록 배치

  Student_caller  Korean  English Student_other  Math
0      KimTaemin      90       80    Jiyoungmin  44.0
1       HaJaehwa      85       90     KimTaemin  33.0
2    JungSayoung      88       40           NaN   NaN
3       Sonjimin      35       44           NaN   NaN
4      Leesoomin      40       55           NaN   NaN
5        KangJun      44       90           NaN   NaN

In [12]:
df1 = pd.DataFrame({'Student': ['KimTaemin','HaJaehwa','JungSayoung','Sonjimin','Leesoomin','KangJun'],
                    'Korean': [90, 85, 88, 35, 40, 44],
                    'English': [80, 90, 40, 44, 55, 90]})
df2 = pd.DataFrame({'Student': ['Jiyoungmin','LeeJae','KimJaehee'],
                    'Korean': [44,73,100]})

print(df1)
print(df2)

       Student  Korean  English
0    KimTaemin      90       80
1     HaJaehwa      85       90
2  JungSayoung      88       40
3     Sonjimin      35       44
4    Leesoomin      40       55
5      KangJun      44       90
      Student  Korean
0  Jiyoungmin      44
1      LeeJae      73
2   KimJaehee     100

In [13]:
pd.concat([df1,df2], sort=False)

       Student  Korean  English
0    KimTaemin      90     80.0
1     HaJaehwa      85     90.0
2  JungSayoung      88     40.0
3     Sonjimin      35     44.0
4    Leesoomin      40     55.0
5      KangJun      44     90.0
0   Jiyoungmin      44      NaN
1       LeeJae      73      NaN
2    KimJaehee     100      NaN

In [14]:
pd.concat([df1,df2], sort=False, ignore_index=True)

       Student  Korean  English
0    KimTaemin      90     80.0
1     HaJaehwa      85     90.0
2  JungSayoung      88     40.0
3     Sonjimin      35     44.0
4    Leesoomin      40     55.0
5      KangJun      44     90.0
6   Jiyoungmin      44      NaN
7       LeeJae      73      NaN
8    KimJaehee     100      NaN

       Student  Korean  English
0    KimTaemin      90     80.0
1     HaJaehwa      85     90.0
2  JungSayoung      88     40.0
3     Sonjimin      35     44.0
4    Leesoomin      40     55.0
5      KangJun      44     90.0
0   Jiyoungmin      44      NaN
1       LeeJae      73      NaN
2    KimJaehee     100      NaN

### 15-4 데이터 관리 프로그램 만들기(3) pandas의 유용한 기능들

필터링 연산
___

In [16]:
df = pd.DataFrame({"A":[1,4,7],"B":[2,5,8],"C":[3,6,9]})

df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [17]:
df['A']

0    1
1    4
2    7
Name: A, dtype: int64

In [20]:
df.loc[[2],['A']]

   A
2  7

In [23]:
print(df.loc[1])

A    4
B    5
C    6
Name: 1, dtype: int64

In [22]:
print(df.loc[0,'B'])

2

In [24]:
print(df.loc[:,'A'])

0    1
1    4
2    7
Name: A, dtype: int64

In [29]:
df.iloc[[0],[1]]

   B
0  2

In [30]:
print(df.iloc[:,0])

0    1
1    4
2    7
Name: A, dtype: int64

In [32]:
print(df.iloc[0,1])

2

### 그룹연산: groupby(), apply()
___

In [36]:
df = pd.DataFrame({'Columns1':['A','A','B','B','C','C','A','B'],
                  'Columns2':[10, 2, 30, -6, 8, 9, 5, 2]})
df

  Columns1  Columns2
0        A        10
1        A         2
2        B        30
3        B        -6
4        C         8
5        C         9
6        A         5
7        B         2

In [37]:
import numpy as np
df.groupby(['Columns1']).max().apply(np.sqrt)

          Columns2
Columns1
A         3.162278
B         5.477226
C         3.000000

### 15-5 데이터 관리 프로그램 만들기(4)

In [2]:
import pandas as pd
import numpy as np
import os

file_path = os.getenv("HOME") + '/aiffel/data_handling/data/Salaries.csv'
sal = pd.read_csv(file_path)

In [6]:
sal['BasePay'].mean()

66327.6889596918

In [12]:
sal['OvertimePay'].max()

245131.88

In [24]:
sal['EmployeeName'](JOSEPH DRISCOLL)

SyntaxError: invalid syntax (<ipython-input-24-cbb1cb6b4666>, line 1)

In [13]:
sal

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148640,148641,Charlene D Mccully,Parking Control Officer,0.00,0.00,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,PT
148641,148642,Raphael Marquis Goins,Museum Guard,0.00,0.00,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,PT
148642,148643,Dominic C Marquez,Sign Worker,0.00,0.00,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,PT
148643,148644,Kim Brewer,Parking Control Officer,0.00,0.00,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,PT
148644,148645,Randy D Winn,"Stationary Eng, Sewage Plant",0.00,0.00,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,PT